IDEA StatiCa Open Model
LoadImpulse Structure
Compatible with IDEA StatiCa Beta 21.0 - beta
 LoadImpulse
 Namespace: IdeaRS.OpenModel.Loading
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public struct LoadImpulse
Public Structure LoadImpulse
public value class LoadImpulse
The LoadImpulse type exposes the following members.
Properties
Name | Description
X
 Load in X direction
Y
 Load in Y direction
Z
 Load in Z direction
Top
See Also
Reference
IdeaRS.OpenModel.Loading Namespace